""""
Написати програму для вирішення квадратного рівнянн: ax**2 + bx + c = 0.
У створеній програмі додати коментарі. Результати вивести на екран.
Також вивисти тип даних результатів, що є розвязком завдання.
"""
try:
    a = float(input("Введіть коефіцієнт а:   "))
    if a == 0:
        print("Коефіцієнт a не може доріівнювати НУЛЬ. Змініть дані")
        exit()
    b = float(input("Введіть коефіцієнт b:   "))
    c = float(input("Введіть коефіцієнт c:   "))
except ValueError:
    print ("Є введені не числові значення. Повторіть спочатку")
    exit()
#  знаходимо дискримінант d = b**2 - 4*a*c
#  якщо d>0, то є два розвязки x1 = (- b + d**(1/2))/(2*a) та x2 = (- b - d**(1/2))/(2*a)
#  якщо d = 0, то є один розвязок x = -b /(2*a)

d = b**2 - 4 * a * c
if d == 0:
    x = -(b / (2 * a))
    print("\n Рівняння має один розвязок  х = {}".format(x))
    print("Отриманий результат має тип даних x = {}".format(type(x)))

elif d >0:
    x1 = (-b + d**(1/2))/(2 * a)
    x2 = (-b - d ** (1 / 2)) / (2 * a)
    print("\n Рівняння має два розвязки х1 = {}, х2 = {} ".format(round(x1,3), round(x2,3)))
    print("Отримані результати мають такі типи даних x1 = {},  x2 = {}".format (type(x1), type(x2)))

else:
    print("\n Рівняння розвязку не має")
