mf= input("ВВедіть стать чоловіча - m, жіноча - f ")

try:#
    age = int(input("Введіть свій вік_"))# вводиться значення, і це значення перевіряється чи воно може бути int
    #"якщо ні, то виконується інструкція except ValueError:

except ValueError:
    print(" Введіть вік числом")
    exit()  # виходить з програми взагалі

if mf=="m" and age <=45:#  граничний вік введено щоб число сприймалось як стрічка, бо змінна age є стрічка.
    print ("Ви ще жеребець")
elif mf=="m" and age >45:
    print("Ура. Скоро на пенсію")
elif mf=="f" and age <=45:
    print ("Ви ще ягідка")
else:
    print("Світло виключили .... і кіно не буде")


