""""
Password storage. Модифікувати програму генерування паролів, яку ви робили на 6 уроці.
Після запуску програми, запистати корисувача, що він хоче зробити: створити новий чи отримати пароль,
 який він вводив раніше. Всі паролі зберігати в чкомусь файлі. Отримати пароль можла за допомогою ключвого слова,
 яке вказує користувач при  створенні нового пароля.

Наприклад: Користувач запускає програму і хоче отримати пароль, який вводив прніше.
Для цьго він водить ключове слово за яким введеться пошщук у файлі і отримується пароль.
Коли корисувач хоче створити новий пароль, то використати код програми з 6 уроку, після генерувавння пароля попровисти
корисувача ввести ключове слово, і дану пару ключ-знгачення записати у файл.

"""