""""
Після того як користувач завершив роботу з програмою, попросити в нього ввести цифру або слово.
 Перед закриттям зашиффрувати увесь текст за шифром Віженера, де ключом виступає введене значення.
 Перед зчитуванянм інформації у файлі попросити користувача ввести ключове слово або цифру
 і розшифорувати інформацію у файлі за введеним ключем.
 Після цього пропонувати створити новий пароль або отримати існуючий.
"""
#  початок роботи- відкрити файл
#  запитати чи потрібно розшифорувати файл
#  взіти файл з паролями добавити ще один пароль чи щось інше в цей файл
#
#  закінчення роботи
#