
"""
Користувач вводить 2 рядки. з даних рядків, відфільтрувати тільки цифри, об’єднати їх у єдине число,
і перевірити, чи числа рівні. Тобто s1 = “ewr123”, s2 = “1sd23”; n1 = 123, n2 = 123. n1 рівне n2
"""
s1 = input("Введіть ОСНОВНУ стрічку для порівняння:   ")
s2 = input("Введіть другу стрічку для порівняння:   ")

def fun (str):
    digit = ""
    for i in str:
        if i.isdigit():
            digit += i
    return digit

f1 = fun(s1)
f2 = fun(s2)
print ("\nОсновна стрічка %s" %s1)
print ("Друга стрічка %s" %s2)

if f1 == f2:
    print("\n Числа зі стрічок ---%s--- = ---%s--- РІВНІ" %(f1,f2))
else:
    print("\n Числа зі стрічок  %s < > %s НЕ рівні" %(f1, f2))


