""""
Вивести на екран квадрат та корінь числа. Потім запросити у користувача ще одне число.
Вивести на екран остачу від ділення на друге число, а також частку.
"""
print("\n Давай пограємось у гру. Кварат- корінь")

try:
    a = float(input("\nВведіть Перше будь-яке число:  "))
except ValueError:
    print ("Ви ввели число буквами. Повторіть дію ще раз")
    exit ()

print(" Квадрат введеного вами числа становить --- {} ---,"
      "\t а Квадратний корінь --- {}---".format (a**2, round(a**(1/2),5)))

try:
    b = float(input("\nВведіть Друге будь-яке число більше нуля:  "))
    if b == 0:
        print("\n Ділення на НУЛЬ заборонено. Операцію повторіть спочатку")
        exit ()
except ValueError:
    print ("Ви ввели число буквами або менше нуля. Повторіть дію ще раз")
    exit ()

print(" Від ділення Першого числа на Друге:\n ОСТАЧА становить ---{}---,"
      "а ЧАСТКА ---{}---".format(a%b, a//b))
