print ("Ваш податок від посади\n")
posada = input('ВВедіть свою посаду(після дефісу) у відповідності з інструкцією:\n'
               ' якщо програміст-prog , бухгалтер-buh , офіціант-waiter, інші посади-another\n'
               ' ')
try:
    zp = float(input("ВВедіть свою заробітну плату.од:    "))
except:
    print("\n"
          "                           Величина заробітноої плати введена не лише цифрами. \n"
          "                           Перезапустіть програму. ")
    exit()

podatok = 0
if posada =="prog":
    podatok = 0.13*zp
    print ("При своїй посаді Ви заплатите %s відсотків податку,\n"
           " що становить %s од суми Вашої заробної плати" % ("13%", podatok))
elif posada =="buh":
    podatok = 0.10 * zp
    print("При своїй посаді Ви заплатите %s відсотків податку,\n"
          " що становить %s од суми Вашої заробної плати" % ("10%", podatok))
elif posada =="waiter":
    podatok = 0.07 * zp
    print("При своїй посаді Ви заплатите %s відсотків податку,\n"
          " що становить %s од суми Вашої заробної плати" % ("7%", podatok))
elif posada =="another":
    podatok = 0.05 * zp
    print("\n"
          "При своїй посаді Ви заплатите %s відсотків податку,\n"
          " що становить %s од суми Вашої заробної плати" % ("5%", podatok))
else:
    print ("        \n"
           "        Ви ввели не існуючу посаду або зробили помилку при її введені.\n"
           "        Інформації по податок не знайдено. Повторіть операцію спочатку")
