""""
Користувач вводить масив значень. Відфільтрувати масив, залишивши в ньому тільки числа
"""
""""
   The isinstance() function returns True if the specified object is of the specified type, otherwise False.
    if isinstance(arr[i], str):
          
        arr2.append(arr[i])- добавлення елементу масиву 
            
            метод "pop" обєкт.pop(index)
        arr.pop[j]  -  Видаляємо елемент списку залежно від індексу
            метод  "del" - видаляє елемент списку., в залежності вд  його індексу("вішака")
        del.arr[j]  - Видаляємо елемент списку залежно від індексу
 """

arr = []  # створюємо пустий масив(ящик для завантаження)
n= int (input ("Введіть кількіть чисел в масиві:    "))

for i in range(n):  # завантаження масиву елементами в кількість n
    value =   input ("Заповніть %s елемент масиву:   " %(i+1))  # заповнення елементів масиву
    arr.append(value)  # до масиву вводяться елементи
print ("Ваш введений масив %s" %arr)

arr2= []  #  створюємоно новий пустий масив
i=0  #  початкове значення індексу для ітерації елементів масиву "arr" присвоюємо нуль "0"

for i in range(n):
    try:
        if arr[i] == int(arr[i]):  #  якщо (правда)_значення елементу масиву можливо зрівняти з його значен в int типу
            continue  #  то продовжити далі і перехід на else
    except ValueError:  #  якщо трапилась помилка, то виконуються дії нижче
        #print (" Елемент масиву %s НЕ число" %(i+1))
        continue
    else:
        arr2.append(arr[i])  #  створення новго масиву з лише числовими елементаим

print ("Відфільтрований масив без строкових данних %s і він містить %s елементів" %(arr2, len(arr2)))
