""""
Вивести на екран суму всіх парних чисел у масиві
"""
arr = []  # створюємо пустий масив(ящик для завантаження)
#  введення кількості елементів масиву
try:
    n= int (input ("Введіть кількіть елементів в масиві:    "))
except ValueError:
    print("ВВедене значення елементів в масиві не є число. Запустіть програму і введіть число ")
    exit()

"цикл для заповнення масиву елементами в кількість n"
for i in range(n):
    value =   input ("Заповніть %s елемент масиву:   " %(i+1))  # заповнення елементів масиву
    arr.append(value)  # до масиву вводяться елементи
print ("\nВаш введений масив %s" %arr)

"Цикл для визначення чи парний елемент масиву"

arr2= []
i=0
suma =0
for i in range (n):
    " перевірка на введення: Чи всі елементи масиву можливо перетворити з str в int"
    try:
        arr[i] = int (arr[i])
    except ValueError:
        print ("Ведений в масив елемент не є числом. Введіть всі елементи в масив числами")

    "Сам цикл визначення чи є число парним"
    if arr[i] == int(arr[i]) and int (arr[i])%2 ==0:
        arr2.append(arr[i])  #створення нового масиву з парними числами
        suma= suma+arr[i]  # сума парнрх елементів масиву

    else:
        continue

arr2 = str(arr2) # має масив з int перетворити в str  але цього не відбувається. Запитати як це зробити!
print ("\nМасив лише з парними числами %s" %arr2)
print ("Сума всіх парних елементів масиву %s" %suma )
