""" Дано список із чисел. Знайти і вивести на екран максимальне число.
"""
""""
для Памяті: 
запис 
for i in arr: # при такому записі будуть бачитись елементи масиву а не їх індекси"
"""
arr = []  # створюємо пустий масив(ящик для завантаження)
n= int (input ("Введіть кількіть чисел в масиві:    "))

""""
                    автоматичне створення масиву та заповнення його елементами - числами
"""
import random  # завантажуємо модуль для генерації випадкових чисел

for i in range(n):  # завантаження масиву елементами в кількість n
    value = random.randint(0, 40)  # генерується випадкове число в заданому діапазоні
    arr.append(value)  # згенероване число додаєтсья до масиву arr
print (arr)

"""" визначаємо найбільше число в масиві"""
j=0  # присвоюється нуль "0" щоб індекси рахувалися з нуля "0"
max =0  # присвоюємо початкове максимальне значення
if n>=j:  # умова що зупиняє цикл, бо індексів(вішаків) на 1 менше ніж елементів
    for j in range(n-1):
        if arr[j]>= max:  # якщо елемент масиву більший ніж максимальне значення,то він присвоюється для максимального значення
            max =  arr[j]
print('Максимальне число масиву %s' %max)
