""""
                     Написати програму, яка перевіряє, чи введене число є паліндромом
"""

arr = []  # створюємо пустий масив(ящик для завантаження)
#  введення кількості елементів масиву
try:
    n= int (input ("Введіть кількіть елементів в масиві:    "))
except ValueError:
    print("ВВедене значення елементів в масиві не є число. Запустіть програму і введіть число ")
    exit()

"цикл для заповнення масиву елементами в кількість n"
for i in range(n):
    value =   input ("Заповніть %s елемент масиву:   " %(i+1))  # заповнення елементів масиву
    arr.append(value)  # до масиву вводяться елементи
print ("\nВаш введений масив %s" %arr )

""" 
створення циклу 
"""
i=j=0  # обнулення для лічильників

for i in range(n):  # йдемо по елементах масиву arr
    b= list(arr[i])  # створюється масив з i-го елементу масиву arr
    n_e_b = len(b)  # визначається скільки елементів в масиві b
    c = n_e_b - 1  # величина останього індексу останього елементу в масиві b

    for j in range((n_e_b)):  # рухаємось по елементах масиву b/індексів буде на 1 менше
        s=0  # обнулення лічильника

        if b[j]==b[c-j]:
            s= s+1  # рахується для визначення чи поліном

            if s == (n_e_b)//2:  # цілочисельне ділення (відкидаєтьсяостача)
                print(" \n Елемент №%s (---%s---) створеного масиву  Є ПОЛІНОМ " % (i+1, arr[i]))
                break  # вихід з масиву якщо умова буде виконана

            elif c==0:  # якщо максимальний індекс = 0, то введено один символ
                print(" \n З елементу №%s (---%s---) створеного масиву ПОЛІНОМ НЕ ВИЗНАЧИТИ" % (i + 1, arr[i]))

        else:
            print(" \n Елемент №%s (---%s---) створеного масиву НЕ ПОЛІНОМ " % (i+1, arr[i]))
            break  # вихід з масиву якщо умова буде виконана
